Revit 2027 API
PanelScheduleView.RenumberIndexes Method
 Renumbers the Circuit Naming Index for the circuits in the panel.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RenumberIndexes()
Public Sub RenumberIndexes
public:
void RenumberIndexes()
member RenumberIndexes : unit -> unit
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace